Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: Connection problems are often due specifying a wrong IP address or having a ``host key verification error``.
it_it: I problemi di connessione sono spesso dovuti all'inserimento di un indirizzo IP errato o a un ``host key verification error``.

source: Consequently, you must have the :term:`Source Directory` in place on your development system in order to do any development using the Yocto Project.
it_it: Di conseguenza, è necessario che la :term:`Source Directory` sia presente sul sistema di sviluppo per poter sviluppare applicazioni con Yocto Project.

source: Consider enabling a Mandatory Access Control (MAC) framework such as SMACK or SELinux and tuning it appropriately for your device's usage. You can find more information in the :yocto_git:`meta-selinux </meta-selinux/>` layer.
it_it: Si consiglia di abilitare un framework di controllo degli accessi obbligatorio (MAC) come SMACK o SELinux e di configurarlo in modo appropriato in base all'utilizzo del dispositivo. Maggiori informazioni nel layer :yocto_git:`meta-selinux </meta-selinux/>`.

source: Considerations Specific to the OpenEmbedded Build System
it_it: Considerazioni Specifiche per il Sistema di Build OpenEmbedded

source: Continuing with the ``gettext-minimal-native`` example, let's first remove the existing shared state artifacts, to make sure the shared state artifacts for my ``do_create_recipe_spdx`` task are re-generated:
it_it: Continuando con l'esempio ``gettext-minimal-native``, rimuoviamo innanzitutto gli artefatti di stato condiviso esistenti, per assicurarci che gli artefatti di shared state per il proprio task ``do_create_recipe_spdx`` vengano rigenerati:

source: Contributing Changes to a Component
it_it: Apportare Modifiche a un Componente

source: Contributing through mailing lists --- Why not using web-based workflows?
it_it: Contribuire tramite mailing list: Perché non utilizzare flussi di lavoro basati sul web?

source: Contributing to the Yocto Project
it_it: Contribuire allo Yocto Project

source: Contributions to the Yocto Project and OpenEmbedded are very welcome. Because the system is extremely configurable and flexible, we recognize that developers will want to extend, configure or optimize it for their specific uses.
it_it: I contributi a Yocto Project e a OpenEmbedded sono benvenuti. Dato che il sistema è estremamente configurabile e flessibile, sappiamo che gli sviluppatori vorranno estenderlo, configurarlo o ottimizzarlo per le loro esigenze specifiche.

source: Contributor Guide
it_it: Guida per i Collaboratori

source: Contributors should ensure that the terms and conditions of the generative AI tool do not place any contractual restrictions on how the tool's output can be used that are inconsistent with the project's open source software license, the project's intellectual property policies, or the Open Source Definition.
it_it: I contributori devono assicurarsi che i termini e le condizioni dello strumento di IA generativa non impongano restrizioni contrattuali sull'utilizzo dell'output dello strumento che siano incompatibili con la licenza del software open source del progetto, le politiche sulla proprietà intellettuale del progetto o la Definizione di Open Source.

source: Copy that over to the target machine::
it_it: Copiarlo sulla macchina target::

source: Create a Git repository for each project with the corresponding files
it_it: Creare un repository Git per ogni progetto con i file corrispondenti

source: Create a ``*.bbappend`` file for the modified recipe. For information on using append files, see the ":ref:`dev-manual/layers:appending other layers metadata with your layer`" section in the Yocto Project Development Tasks Manual.
it_it: Creare un file ``*.bbappend`` per la ricetta modificata. Per informazioni sull'utilizzo dei file di append, consultare la sezione ":ref:`dev-manual/layers:appending other layers metadata with your layer`" nel Manuale di Sviluppo dei Task di Yocto Project.

source: Create a new :term:`configuration file` on your host **in a safe location** and add the two following statements::
it_it: Creare un nuovo :term:`configuration file` sul proprio host **in una posizione sicura** e aggiungere le due seguenti istruzioni::

source: Create a new branch
it_it: Creare un nuovo branch

source: Create a recipe for each project
it_it: Creare una ricetta per ogni progetto

source: Create and place the new ``interfaces`` configuration file in the BSP's layer here::
it_it: Creare e posizionare il nuovo file di configurazione ``interfaces`` nel layer del BSP qui::

source: Create the :term:`Build Directory` inside your Source Directory and let the name of the :term:`Build Directory` default to ``build``:
it_it: Creare la :term:`Build Directory` all'interno della Source Directory e lascia che il nome predefinito della :term:`Build Directory` sia ``build``:

source: Create toaster user and set its home directory to ``/var/www/toaster``::
it_it: Crea l'utente toaster e impostare la sua directory home su ``/var/www/toaster``::

source: Creating Patches
it_it: Creazione di Patch

source: Creating Your Own General Layer
it_it: Creazione di un Proprio Layer Generico

source: Creating a Django Superuser
it_it: Creazione di un Superutente Django

source: Creating a Read-Only Root Filesystem
it_it: Creazione di un Filesystem Root di Sola Lettura

source: Creating a new BSP Layer Using the ``bitbake-layers`` Script
it_it: Creazione di un Nuovo Layer BSP Tramite lo Script ``bitbake-layers``

source: Creating a superuser allows you to access the Django administration interface through a browser. The URL for this interface is the same as the URL used for the Toaster instance with "/admin" on the end. For example, if you are running Toaster locally, use the following URL::
it_it: La creazione di un superutente consente di accedere all'interfaccia di amministrazione di Django tramite un browser. L'URL per questa interfaccia è lo stesso URL utilizzato per l'istanza di Toaster con "/admin" alla fine. Ad esempio, se se si sta eseguendo Toaster in locale, si usa il seguente URL::

source: Creating the Root Filesystem
it_it: Creazione del Filesystem Root

source: Creation of these toolchains is simple and automated. For information on toolchain concepts as they apply to the Yocto Project, see the ":ref:`overview-manual/concepts:Cross-Development Toolchain Generation`" section in the Yocto Project Overview and Concepts Manual. You can also find more information on using the relocatable toolchain in the :doc:`/sdk-manual/index` manual.
it_it: La creazione di queste toolchain è semplice e automatizzata. Per informazioni sui concetti relativi alle toolchain applicati a Yocto Project, consultare la sezione ":ref:`overview-manual/concepts:Cross-Development Toolchain Generation`" nel Manuale Introduttivo e Concetti di Yocto Project. Ulteriori informazioni sull'utilizzo della toolchain riallocabile sono disponibili nel manuale :doc:`/sdk-manual/index`.

source: Criteria for Qualifying Upstreams
it_it: Criteri per l'Approvazione degli Upstream

source: Cross-Development Toolchain Generation
it_it: Generazione di Toolchain di Cross-Sviluppo

source: Currently, the 6.1 release ("Blacksail") of the Yocto Project is supported on the following distributions:
it_it: Attualmente, la versione 6.1 ("Blacksail") di Yocto Project è supportata dalle seguenti distribuzioni:

source: Custom tasks should be sorted similarly.
it_it: I task personalizzati devono essere ordinate in modo simile.

source: Customizing Pre-Set Data
it_it: Personalizzazione dei Dati Pre-Impostati

source: Customizing Your Build for Specific Hardware
it_it: Personalizzazione della Build per un Hardware Specifico

source: Customizing a Recipe for a BSP
it_it: Personalizzazione di una Ricetta per un BSP

source: Default processing for patch files assumes the files have either ``*.patch`` or ``*.diff`` file types (or a compressed form of those file types). You can use :term:`SRC_URI` parameters to change the way the build system recognizes patch files. See the :ref:`ref-tasks-patch` task for more information.
it_it: L'elaborazione di default dei file di patch presuppone che i file abbiano estensione ``*.patch`` o ``*.diff`` (o una versione compressa di tali estensioni). È possibile utilizzare i parametri :term:`SRC_URI` per modificare il modo in cui il sistema di build riconosce i file di patch. Per ulteriori informazioni, consultare il task :ref:`ref-tasks-patch`.

source: Defining BitBake Version
it_it: Definizione della Versione di BitBake

source: Defining Layer Definitions
it_it: Definizione delle Definizioni dei Layer

source: Defining Release
it_it: Definizione della Release

source: Defining a common BSP directory structure allows end-users to understand and become familiar with that standard. A common format also encourages standardization of software support for hardware.
it_it: Definire una struttura di directory BSP comune consente agli utenti finali di comprendere e familiarizzare con tale standard. Un formato comune incoraggia inoltre la standardizzazione del supporto software per l'hardware.

source: Defining the Default Distro and Other Values
it_it: Definizione della Distribuzione di Default e di Altri Valori

source: Defining the Release Default Layer Names
it_it: Definizione dei Nomi dei Layer di Defaultper la Release

source: Dependent on the :term:`OpenEmbedded-Core (OE-Core)` metadata, this directory adds just enough metadata to define the Poky reference distribution.
it_it: A seconda dei metadati di :term:`OpenEmbedded-Core (OE-Core)`, questa directory aggiunge i metadati necessari per definire la distribuzione di riferimento di Poky.

source: Depending on the choice above, new options can be prompted to further specify which configuration to use. For example:
it_it: A seconda della scelta precedente, potrebbero essere richieste nuove opzioni per specificare ulteriormente quale configurazione utilizzare. Ad esempio:

source: Depending on the recipe, certain security flags are enabled and disabled by default.
it_it: A seconda della ricetta, alcuni flag di sicurezza sono abilitati o disabilitati per impostazione predefinita.

source: Depending on the type of packages being created (RPM, DEB, or IPK), the :ref:`do_package_write_* <ref-tasks-package_write_deb>` task creates the actual packages and places them in the Package Feed area, which is ``${TMPDIR}/deploy``. You can see the ":ref:`overview-manual/concepts:package feeds`" section for more detail on that part of the build process.
it_it: A seconda del tipo di pacchetti creati (RPM, DEB o IPK),, il task :ref:`do_package_write_* <ref-tasks-package_write_deb>` crea i pacchetti effettivi e li posiziona nell'area del Package Feed, ovvero ``${TMPDIR}/deploy``. Per maggiori dettagli su questa parte del processo di build, consultare la sezione ":ref:`overview-manual/concepts:package feeds`".

source: Description
it_it: Descrizione

source: Despite its name, the `siginfo` file is unrelated to GPG signing.
it_it: Nonostante il nome, il file `siginfo` non è correlato alla firma GPG.

source: Determine and select the "Severity" of the bug. The severity indicates how the bug impacted your work.
it_it: Determinare e selezionare la "Severity" del bug. La severity [gravità] indica l'impatto del bug sul lavoro.

source: Determining Status of Builds in Progress
it_it: Determinare lo Stato delle Build in Corso

source: Determining Status of a Specific Build
it_it: Determinazione dello Stato di una Build Specifica

source: Developers (including contributing community members) create and maintain cloned repositories of upstream branches. The cloned repositories are local to their development platforms and are used to develop changes. When a developer is satisfied with a particular feature or change, they "push" the change to the appropriate "contrib" repository.
it_it: Gli sviluppatori (inclusi i membri della community che contribuiscono) creano e mantengono repository clonati dei branch upstream. I repository clonati sono locali alle rispettive piattaforme di sviluppo e vengono utilizzati per implementare le modifiche. Quando uno sviluppatore è soddisfatto di una particolare funzionalità o modifica, ne effettua il "push" al repository "contrib" appropriato.

source: Developers are responsible for keeping their local repository up-to-date with whatever upstream branch they are working against. They are also responsible for straightening out any conflicts that might arise within files that are being worked on simultaneously by more than one person. All this work is done locally on the development host before anything is pushed to a "contrib" area and examined at the maintainer's level.
it_it: Gli sviluppatori sono responsabili di mantenere aggiornato il proprio repository locale con il branch upstream su cui stanno lavorando. Sono inoltre responsabili della risoluzione di eventuali conflitti che potrebbero sorgere all'interno di file su cui lavorano simultaneamente più persone. Tutto questo lavoro viene svolto localmente sull'host di sviluppo prima che qualsiasi modifica venga inviata all'area "contrib" e analizzata dal manutentore.

source: Developers specify architecture, policies, patches and configuration details.
it_it: Gli sviluppatori specificano architettura, policy, patch e dettagli di configurazione.

source: Developing a Board Support Package (BSP)
it_it: Sviluppo di un Board Support Package (BSP)

source: Developing using the Yocto Project likely requires the use of :ref:`overview-manual/development-environment:git`. Git is a free, open source distributed version control system used as part of many collaborative design environments. This section provides workflow concepts using the Yocto Project and Git. In particular, the information covers basic practices that describe roles and actions in a collaborative development environment.
it_it: Lo sviluppo con Yocto Project richiede probabilmente l'uso di :ref:`overview-manual/development-environment:git`. Git è un sistema di controllo di versione distribuito, gratuito e open source, utilizzato in molti ambienti di sviluppo collaborativo. Questa sezione illustra i concetti relativi ai flussi di lavoro con Yocto Project e Git. In particolare, vengono descritte le pratiche di base che illustrano ruoli e azioni in un ambiente di sviluppo collaborativo.

source: Development Cycle
it_it: Ciclo di Sviluppo

source: Development Methods
it_it: Metodi di Sviluppo

source: Development Tasks Manual
it_it: Manuale dei Task di Sviluppo

source: Development Tools
it_it: Strumenti di Sviluppo

source: Different QA and sanity checks run throughout entire build process.
it_it: Diversi controlli di qualità e di integrità vengono eseguiti durante l'intero processo di build.

source: Display Support Files
it_it: File di Supporto per il Display

source: Distribution settings define the packaging back-end (e.g. rpm or other) as well as the package feed and possibly the update solution. You would create your own distribution in a new layer inheriting from :term:`Poky` but overriding what needs to change for your distribution. If you find yourself adding a lot of configuration to your :ref:`structure-build-conf-local.conf` file aside from paths and other typical local settings, it's time to :ref:`consider creating your own distribution <dev-manual/custom-distribution:creating your own distribution>`.
it_it: Le impostazioni della distribuzione definiscono il back-end di creazione dei pacchetti (ad esempio rpm o altro), il feed dei pacchetti e, eventualmente, la soluzione di aggiornamento. Dovresti creare la tua distribuzione in un nuovo layer che eredita da :term:`Poky` ma sovrascrivendo ciò che deve essere modificato per la tua distribuzione. Se ti ritrovi ad aggiungere molta configurazione al tuo file :ref:`structure-build-conf-local.conf` oltre ai percorsi e ad altre tipiche impostazioni locali, è il momento di :ref:`considerare la creazione di una propria distribuzione <dev-manual/custom-distribution:creating your own distribution>`.

source: Distro Layer
it_it: Layer Distro

source: Django prompts you for a password, which you must provide.
it_it: Django richiederà una password, che è obbligatoria.

source: Django prompts you for an email address, which is optional.
it_it: Django richiederà un indirizzo email, che è facoltativo.

source: Django prompts you for the username, which you need to provide.
it_it: Django richiederà il nome utente, che è necessario fornire.

source: Django prompts you to re-enter your password for verification.
it_it: Django richiederà di reinserire la password per la verifica.

source: Documentation Downloads
it_it: Download della Documentazione

source: Documentation Index
it_it: Indice della Documentazione

source: Documentation for the BitBake tool is available separately. See the :doc:`BitBake User Manual <bitbake:index>` for reference material on BitBake.
it_it: La documentazione per il tool BitBake è disponibile separatamente. Consultare il :doc:`Manuale Utente di BitBake <bitbake:index>` per materiale di riferimento su BitBake.

source: Documentation for the security mechanisms themselves, which can often be found in the documentation of the feature itself. This manual focuses on how to integrate those security mechanisms within the Yocto Project.
it_it: Documentazione relativa ai meccanismi di sicurezza stessi, che spesso si trova nella documentazione della funzionalità stessa. Questo manuale si concentra su come integrare tali meccanismi di sicurezza all'interno di Yocto Project.

source: Documentation on using the :manpage:`'perf script' Python binding <perf-script-python(1)>`.
it_it: Documentazione sull'utilizzo di :manpage:`'perf script' Python binding <perf-script-python(1)>`.

source: Don't forget to update your kernel recipe with::
it_it: Non dimenticare di aggiornare la ricetta del kernel con::

source: Don't let the fact that it's part of the kernel fool you into thinking that it's only for tracing and profiling the kernel --- you can indeed use it to trace and profile just the kernel, but you can also use it to profile specific applications separately (with or without kernel context), and you can also use it to trace and profile the kernel and all applications on the system simultaneously to gain a system-wide view of what's going on.
it_it: Non lasciatevi ingannare dal fatto che faccia parte del kernel: non serve solo per tracciare e profilare il kernel stesso. È possibile utilizzarlo per tracciare e profilare il solo kernel, ma anche per profilare applicazioni specifiche separatamente (con o senza contesto kernel), e persino per tracciare e profilare simultaneamente il kernel e tutte le applicazioni presenti sul sistema, ottenendo così una visione completa di ciò che sta accadendo.

source: Double quotes should be used on the right-hand side of the assignment, e.g. ``FOO = "bar"`` not ``FOO = 'bar'``
it_it: Le virgolette doppie devono essere utilizzate a destra dell'assegnazione, ad esempio ``FOO = "bar"`` non ``FOO = 'bar'``

source: Double-clicking on one of those functions will in turn change the focus to the selected function, and so on.
it_it: Facendo doppio clic su una di queste funzioni, il focus si sposterà sulla funzione selezionata, e così via.

source: Downloading a Pre-Built ``buildtools`` Tarball
it_it: Download di un Archivio Tarball Precompilato di ``buildtools``

source: During "fetch", there may be an inability to find code. During "extract", there is likely an invalid zip or something similar. In other words, the function of a particular part of the workflow gives you an idea of what might be going wrong.
it_it: Durante la fase di "fetch", potrebbe verificarsi l'impossibilità di reperire il codice. Durante la fase di "extract", è probabile che si riscontri un archivio zip non valido o un problema analogo. In altri termini, la funzione di una determinata parte del flusso di lavoro fornisce un'indicazione su cosa potrebbe non funzionare correttamente.

source: During a build process, the build system tracks dependencies and performs a native or cross-compilation of each package. As a first step in a cross-build setup, the framework attempts to create a cross-compiler toolchain (i.e. Extensible SDK) suited for the target platform.
it_it: Durante un processo di compilazione, il sistema di build tiene traccia delle dipendenze ed esegue una compilazione nativa o incrociata [cross] di ciascun pacchetto. Come primo passo in una configurazione di cross-compilazione, il framework tenta di creare una toolchain di cross-compilazione (ovvero un SDK estensibile) adatta alla piattaforma target.

source: During a build, it can be necessary to perform operations that require system administrator privileges. For example, file ownership or permissions might need to be defined. Pseudo is a tool that you can either use directly or through the environment variable ``LD_PRELOAD``. Either method allows these operations to succeed even without system administrator privileges.
it_it: Durante una build, può essere necessario eseguire operazioni che richiedono privilegi di amministratore di sistema. Ad esempio, potrebbe essere necessario definire la proprietà o i permessi dei file. Pseudo è uno strumento utilizzabile direttamente o tramite la variabile d'ambiente ``LD_PRELOAD``. Entrambi i metodi consentono di eseguire queste operazioni con successo anche senza privilegi di amministratore di sistema.

source: During a build, it may often be the case that the output / result of a task might be unchanged despite changes in the task's input values. An example might be whitespace changes in some input C code. In project terms, this is what we define as "equivalence".
it_it: Durante una build, può capitare che l'output/risultato di un task rimanga invariato nonostante le modifiche ai valori di input del task stesso. Un esempio potrebbe essere la modifica degli spazi bianchi in del codice C di input. In termini di progetto, questo è ciò che definiamo "equivalenza".

source: During development, it's convenient to relax security in your builds and allow the use of empty passwords or root logins. This is typically done by adding the values "allow-empty-password", "allow-root-login", and "empty-root-password" to your build's image features, commonly with the addition of the line::
it_it: Durante lo sviluppo, è utile ridurre il livello di sicurezza delle build e consentire l'utilizzo di password vuote o accessi come root. Questo viene generalmente fatto aggiungendo i valori "allow-empty-password", "allow-root-login" e "empty-root-password" alle funzionalità dell'immagine di build, solitamente aggiungendo la riga::

source: During execution, a prompt appears that allows you to choose the installation directory. For example, you could choose the following: ``/home/your-username/buildtools``
it_it: Durante l'esecuzione, verrà visualizzato un prompt che permetterà di scegliere la directory di installazione. Ad esempio, si potrebbe scegliere il seguente path: ``/home/your-username/buildtools``

source: During execution, a prompt appears that allows you to choose the installation directory. For example, you could choose the following: ``/home/your_username/buildtools``
it_it: Durante l'esecuzione, verrà visualizzato un prompt che consente di scegliere la directory di installazione. Ad esempio, è possibile scegliere la seguente: ``/home/your_username/buildtools``
